Chris ['That sucks.']
Chris ["One of the very cut-and-dry things is that people's cars suck up all their money."]
Chris ['So you had a week where it was go time, Operation Get the Fuck Out.']
Chris ['That sucks.']
Chris ['Give me the good shit, dog.']
Chris ['Or are you saying ran into each other at the fair, and then behind the fucking Gravitron, you get conceived?']
Chris ['Goddamn, man.']
Chris ['What are the moments that you feel like, "Fuck yeah.']
Chris ["And I get it's hard to admit that and people judge it and it's hard to just kind of suck it up and go get help but it sounds to me like you're well aware that you got to."]
Chris ["But what's the other shit you can be doing?"]
Chris ["I don't think that that's fucking fair.", "I bet that's fucking exhausting and it has been from day one."]
Chris ['Oh, shit."']
Chris ["There's shit to do in Dallas."]
Chris ["But you're going to feel fucking alive, man."]
Caller ['And I was like, "Oh, it\'s spark plugs and whatever the fuck."']
Caller ["I'm going to have some good shit for you, Chris."]
Caller ['When I was born, my mom had been in prison, and they let her out of prison to have me.']
Caller ['"Our daughter fucked up."']
Caller ['I got teacher certification, and I was just kind of like, "Ah, fuck it."']
{"id": 1, "title": "Ron Paul's Baby", "date": "3/15/2016", "profanity_counts": {"Chris": 15, "Caller": 5}},
Chris ['I fucking hate this guy.', "You're so lucky that you're not, because this guy sounds like a fucking creep."]
Chris ['", and then this fucking married dude, who apparently is attracted to kids and put himself in an environment to be around them, could do that.']
Chris ['", and it\'s great that it didn\'t traumatize you, but I would also say just a big hefty fuck that guy.']
Chris ['Aw, fuck this guy.']
Chris ['Oh, son of a bitch.', 'I hope this motherfucker gets hit by lightning.']
Chris ['You go on a date with this fucking guy?']
Chris ['And you\'ve been laughing the whole time, I\'m going to be honest, and say that you are laughing at a lot of times where I think anyone who is hearing you laughing would say, "No, that\'s a fucked up thing.', '", and you seem to laugh to cover up the fucked up side of it.']
Chris ['The fuck does that mean?']
Chris ["Because I tell you, I've known a lot or teachers in my life, I grew up with a lot of people that become teachers, and they are all super psyched and want to bring that shit home with them all the time.", 'Nobody is like, "Oh I love this thirteen year old\'s school work so much that I\'m going to bring it home so I can fucking soak in it at home."']
Chris ["And they're not required to report that shit?"]
Chris ['Son of a Bitch.']
Chris ['This fucking guy.']
Chris ['That sucks, that sucks.']
Chris ['I\'m sure seeing that he can just fucking chill out at a Starbucks is bringing up a lot of thoughts of, "Holy shit, wait what?']
Chris ['Anytime I am on a subway car with high school kids here\'s what I\'m thinking, "Time to fucking time to switch cars.']
Chris ["Here's what I can do, here's what I can do because I can stress out with you and I can stress about you, but here's another thing I can do, is if in some fucking world this guy ever hears this, I want you to know that I'm not the one you put in the middle of it and I'm not the one you confused, and you're a fucking bad person deep down."]
Chris ["I really, I don't know, I got to say, I got to say, I don't want to put it on you, I don't want to assume anything, but you always laugh when I'm talking about the most fucked up shit and it makes me feel like there's unresolved stuff there and I hope you resolve it."]
Caller ["So I think at this point, and maybe it's fucked up, but up until he said that, I have felt so forgiving and generous, and like I felt like I have not been terribly scared by it.", 'It was fucked up, but I think I was probably the only one, it was what it was.']
Caller ['This is really fucked up, he needs to be fired.']
Caller ["Which maybe sounds a little fucked up if I'm like well if I was the only one it's okay, but if I am, and I was the only one, I do feel like it's not worth ruining his life over."]
{"id": 51, "title": "Made Out with My Teacher", "date": "3/7/2017", "profanity_counts": {"Chris": 21, "Caller": 4}},
Chris ['Because that sounds like you really went big on some baller shit.']
Chris ['That sucks.']
Chris ['This is my favorite shit.', "This is my favorite shit I've heard in a long time."]
Chris ['I also tend to talk shit like this and then never follow through, but that one would be exciting to me.']
Chris ["Similarly, because I don't know if this is just an ignorance that ... basically, before I even ask more questions like this in my excited, giddy little shitty tone, sorry Sally, is there often ... is one of the major things that ignorant people ask you about basically comparing deaf people to spies in some way who have access to information we don't?"]
Chris ["I'll tell you, I was sitting here patting myself on the back the whole time feeling like I was being very sensitive, and here I am putting my foot in my mouth get again with this goddamn podcast.", 'Okay, and I\'ve said it about 85 times and you\'ve just sucked it up each time, and then with seven and a half minutes left you\'re like, "Yo, fuck off on that."']
Chris ['I bet there are a lot of people who just started giggling, going, "Oh, Gethard, you just put your foot in a pile of shit."']
Chris ['Oh, a total shit show, most of the-']
Chris ['Shit, shit, shit, diarrhea.']
Caller ['Fuck you, this is great.']
Caller ["Everyone's got their shit going on."]
Caller ['It\'s like, it\'s not about you, and trust me, I have to deal with this shit over and over and over again every day, so if you can just for one moment realize, "Hey, they\'re going to go a different route than I\'m used to," and just accept it as it is, and you actually might have some fun and learn something new out of it, too, so why get panicky and angry and frustrated just because I might write down something for you, hand it to you, and give you a thumbs up versus vocalizing it?']
Caller ["You've got to figure out what the fuck happened?"]
Caller ["That is such a fucking hearing person thing, and I think it's weird that you guys eavesdrop on each other all the time, and the fact that you guys hear each other pee and poop is weird, too."]
Caller ['Again, my experience, but a lot of deaf people are shit talkers.', "We're blunt ass people."]
Caller ['The first ... or main, shit.']
Caller ['It was one of those stupid ...']
Caller ["I mean, it's still used in government forms and shit."]
Caller ['Shit, shit, shit.']
{"id": 65, "title": "Deaf", "date": "6/13/2017", "profanity_counts": {"Chris": 11, "Caller": 11}},
Chris ["It's that younger one who is a real pain in the ass.", 'That little guy is just a pain in that ass.']
Chris ['Never felt like a bigger, more worthless piece of shit than right now.', "You are a saint and a superhero and I'm some fucking dummy who gets a lot of credit."]
Caller ["And it's so nice with all of the crap that goes on in the world and all the awful stuff that we see and hear."]
Caller ["So she's being treated like she has skin cancer, which has never, ever been done to a child with her type of cancer."]
{"id": 69, "title": "Love is Everywhere", "date": "7/11/2017", "profanity_counts": {"Chris": 4, "Caller": 2}},
Chris ['And then I went in the other direction and I just went and made fucking cash bro.']
Chris ['Also, what the fuck is up with the platypus?']
Chris ["You said maybe the sex thing ... you go through all these different things and then it's a fucking typo that saves your life."]
Chris ['It was such bullshit.']
Chris ['You just fucking owned me in front of Baltimore bro.']
Chris ["One of the things that I find people are always shocked by when I leave America, people always ask me why do you guys have commercials for medications and then you think about that for 10 seconds and you're like oh yeah, that's fucked man."]
Chris ["For anyone who couldn't hear how that call ended, it ended with Heath yelling the words abra-ca-fucking-dabra."]
Caller ['That Billy Bragg song man, so fucking good.']
Caller ['Fucking do it.']
Caller ["And one therapist said to my mom, he's not schizophrenic it's just ... being really cruel to ... Oh, shit I just said my name."]
Caller ['No one knows what the fuck is up with a platypus, no one knows.']
Caller ['I think that what happened for me no mater how much I was drinking or using or, excuse me language, but fucking or lying or whatever I was doing to escape my mind it just stopped working.']
Caller ["I made a pretty decent attempt at suicide and I woke up the next morning obviously alive in a pool of my own piss and puke and blood and the second I woke up, and I've never been religious per se but I woke up and I had this sense that God had intervened, something bigger than me had intervened because if it was up to me I wouldn't be on this call with you right now."]
Caller ["And I was really still fucked up and I didn't find God there."]
Caller ["And so I Googled it and there was one happening down the road from me at midnight and I thought fuck it, this is my last ditch attempt, if I don't find a solution there I'll just kill myself and I drove over there with a shaw over my head and my socks outside of my shoes so that my footsteps were quieter and I walked in and this guy at the door said welcome, we're so glad you're here."]
Caller ["I mean Chris you haven't seen the trick so let's not make judgements on good the trick is or how dumb the trick is."]
Caller ["They're like that's fucking crazy and I never knew that perhaps was a bit of a chaotic and scary way to grow up, you know?"]
Caller ["He's a pretty ugly kinda guy and a lot of my identity I think was wrapped up in this guy fucked me over."]
Caller ["So I'm walking down, I still got like an hour so I sit in the coffee shop and I'm having a coffee by myself and I'm sitting there reading the menu and the next thing I know is my face is attached to the menu and I peel myself off of it like what the fuck is going on and I look around and the buildings are getting really big and really small and really big and really small and it's getting really crazy and psychedelic.", "I got no idea what's going on and I could've realized that somehow I've induced some kind of trip and made myself like crazy high, like I was tripping and I started laughing to myself and I look around and realize that everyone in the coffee shop is staring at me with these red eyes and I'm like this is too fucking weird for me.", "So I walk up to the counter to pay for my coffee and the woman looks back at me and says in a perfect American accent you haven't ordered a coffee sir which freaks me the fuck out and I'm running down the street."]
Caller ["Because my mom was still loaded when she was a child so she was in and out of foster care and lived through a whole bunch of sexual abuse and all kinds of ugly stuff and as a result she ended up really struggling as an adult and she's incarcerated and she'll be in there for ... she ended up getting a really hefty sentence and she's not getting out anytime soon."]
Caller ['I was at work the other day and dropped everything to run and someone was like what the fuck are you doing?']
{"id": 72, "title": "Aussie Best Friend", "date": "8/1/2017", "profanity_counts": {"Chris": 7, "Caller": 16}},
Chris ['Apes ride horses and shit.']
Chris ["I will say with that laugh, maybe that's why there's 20 fucking ducklings around at all times."]
Chris ['Hell yeah dude.']
Chris ['Hell yeah dude.']
Chris ["Yeah, and also lets be clear, you're being really cool about it and for anybody who is listening and who may know you now, I'm not asking you to talk shit about this.", "I'm not asking you to try to talk shit about your peers, I'm just trying to say-"]
Chris ['With shit on the ground.']
Chris ["I'm not going to bother you about it, but just connecting those dots... holy shit you really toughed it out."]
Chris ["You know this is now just becoming a pissing contest of me trying to describe your laugh in a way that gets you to laugh, and then you're really trying hard to keep a straight face, because you don't want to give that to me."]
Chris ["You're going to get me in trouble with my mom, because I've gone on record, don't go to college, it's dumb."]
Chris ["I don't want every asshole who signs up for an Improv class to blame me."]
Chris ['This is everything... this is the stereotype of my career and this show is like, heartfelt emo bullshit, and then the most cockamamie thing that could possibly be layered with that.']
Caller ['I was in a very down time in my life where I was couch surfing and just like sleeping in my car all this crap-']
Caller ["I don't know how the crap they're making it."]
{"id": 94, "title": "The Puppet Master", "date": "1/9/2018", "profanity_counts": {"Chris": 12, "Caller": 2}},
Chris ["I'm lucky son of a bitch."]
Chris ['Damn, damn.']
Chris ['Really, because I was anticipating you get back on the phone with your dad and he\'s like, "Come the fuck on.']
Chris ["I'm glad you didn't stick with that shit head from high school."]
Chris ['I was like, "Holy shit.']
Chris ['My whole God damn life, oh God damn ...']
Chris ["It's funny, because on some level they were just bullies, but it was also like a big pissing contest, who could be the craziest one."]
Chris ['Everyone is going to lose their fucking minds in this episode.', "You're a grandma, and you're being real adorable, and everybody is about to lose their fucking minds.", "I will tell you if you ask my wife what the worst thing about living with me is, it's little piles of shit everywhere."]
Chris ["I pick it up, and it's just covered in shit."]
Chris ["I'm not trying to be a jerk."]
Chris ['That sucks.']
Caller ["I guess sometimes if things that are hard that are happening in my life, then I kind of tend to shut down a little bit with my family, just because I guess I don't want to be an emotional wreck in front of them."]
{"id": 119, "title": "39 Year Old Grandma", "date": "7/2/2018", "profanity_counts": {"Chris": 13, "Caller": 1}},
Chris ['For me, I\'m like "Holy shit."']
Chris ['What the fuck is going on?"']
{"id": 121, "title": "Prison Bound", "date": "7/16/2018", "profanity_counts": {"Chris": 2, "Caller": 0}},
Chris ['So just on a basic level people are a little fucked up; sorry, Sally.']
Chris ['So I just didn\'t grow up where people had guns, and that is one thing of everyone has the knee-jerk reaction that basically boils down to, "Why don\'t they just do it the way I grew up with, where nobody has guns?"', 'Or if you grew up around guns, "Why are these idiots allowed to have guns?']
Chris ["We all fight on fuckin' Facebook, and who gives a shit about that?"]
Chris ['Experts, people who have actually studied this shit.']
Chris ['I can screen grab it first, I can block you, and then I can put up the screen grab so I can talk about what an asshole and what an idiot you are.']
Chris ['And then there\'s 10 percent that are like, "Why is your bullshit ass ugly face on Tru TV?']
Caller ['We had no clothes to change into, so one of the worst parts about that whole experience for me was having to wake up, put the clothes back on that I was wearing the night before that were torn, and bloody, and dirty, and look at the news and see what happened.']
Caller ['I hate to say it, but idiots can get their hands on guns, and how easy it is.']
{"id": 132, "title": "I Survived a Mass Shooting", "date": "10/1/2018", "profanity_counts": {"Chris": 7, "Caller": 2}},
Chris ["I'm the one who sucks."]
Chris ['You got enough shit going on without me getting mad at you.']
Chris ['So it was like a really fucked up, unfunny Marx Brothers routine.']
Chris ['You got two geckos, two horny-ass geckos.']
Chris ['Oh, son of a bitch.']
Chris ["I guess I'm an idiot who doesn't know enough about hedgehogs."]
Chris ["I am an idiot who doesn't know enough about hedgehogs."]
Chris ["And you think you're going to hate you because you haven't seen fucking Lord of the Rings?", "No, it probably just reflects that you're out there living more of a full life than the rest of us pop-culture-obsessed fucking jerks."]
Chris ['She just beats the shit out of your nephew, who loves Uno?']
Chris ["So before you give into the desire to be a fucking disconnected from humanity internet troll about it, she's huddled under an electric blanket that's plugged into a generator while you tweet about sound quality from the warmth of your fucking home that still exists."]
Chris ['Now, your mom yelled at some geckos to not play grab ass.']
Chris ['Sounds like in those situations your mom dials down the hippie and dials up the redneck, huh?']
Chris ["When I was 21, I wasn't dealing with any of this and I was so fucking bitter and angry and sad."]
Chris ['It sounds like the geckos fucked.']
Caller ['It sucks, but it could be worse.']
Caller ['While I was waiting for my mom to come out of her room and do something about this mess, I got my dogs outside, and they just ran out and stayed there and looked at me like, "What the hell is going on?"']
Caller ['She opens one of the lids, grabs the gecko, throws it in the cage with the other gecko and goes, "Y\'all better fucking behave," and then hands the cage to me and tells me to take it outside.']
Caller ['With that comes a lot of really weird shit that you have to deal with, like waking up in the middle of the night and gassing the generator up.']
Caller ['She kicks ass.']
Caller ["I mean, all of the really crazy stuff is if you're freaking out about this house fire, you would completely lose your shit about the craziest things that have happened in my life."]
Caller ["But I'm forgetting all of those things during this call because of this most recent crazy ass thing that's happened."]
{"id": 138, "title": "House Burned Down", "date": "11/12/2018", "profanity_counts": {"Chris": 15, "Caller": 7}},
